-- 1

-- Добавление индекса
CREATE INDEX ведомости_ид_idx 
ON Н_ВЕДОМОСТИ (ИД);

CREATE INDEX ведомости_оценка_idx 
ON Н_ВЕДОМОСТИ (ОЦЕНКА);

-- Основной код 
EXPLAIN
SELECT Н_ОЦЕНКИ.КОД, Н_ВЕДОМОСТИ.ДАТА
FROM Н_ОЦЕНКИ
INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ОЦЕНКА = Н_ОЦЕНКИ.КОД
WHERE Н_ОЦЕНКИ.КОД > '2'
AND Н_ВЕДОМОСТИ.ИД > '1250972'
AND Н_ВЕДОМОСТИ.ИД > '1457443';

-- 2

-- Добавление индекса 
CREATE INDEX index_id
ON Н_ЛЮДИ (ИД);

CREATE INDEX index_man_id
ON Н_ОБУЧЕНИЯ (ЧЛВК_ИД);

CREATE INDEX index_man_id
ON Н_УЧЕНИКИ (ЧЛВК_ИД);

-- Основной код
EXPLAIN
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.НАЧАЛО
FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
LEFT JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE Н_ОБУЧЕНИЯ.ЧЛВК_ИД = '113409';
